app/controllers/authentications_controller.rb


        # continue on valid uid and provider
        if uid != '' and provider != ''
          auth = Authentication.find_by_provider_and_uid(provider, uid)
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'facebook' AND `authentications`.`uid` = '100001071283803' LIMIT 1

            auth_hash = {:provider => provider, :uid => uid, :name => name, :email => email, :first_name => first_name, :last_name => last_name, :token => omniauth['credentials']['token']}
            user.apply_omniauth(auth_hash)
            #user.confirm!
            if user.save!
---
UPDATE `users` SET `last_sign_in_at` = '2012-02-14 17:31:28', `current_sign_in_at` = '2012-02-15 04:53:43', `sign_in_count` = 7, `updated_at` = '2012-02-15 04:53:43' WHERE `users`.`id` = 1