app/controllers/challenges_controller.rb

  def show_soc
    @flg = params[:flg]
    @challenge = Challenge.find(params[:id])

    @is_complete_status = 0
    @challenge.tasks.each do |checkingTaskStatus|
      unless checkingTaskStatus.is_complete == 1
        @is_complete_status = 1
        next
      end
    end
    if @is_complete_status == 0
      Challenge.where(:_id => params[:id]).update(:is_complete => 1)
    end
    @org = User.find(:all,:conditions => ["id=?",@challenge.user_id]).first
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def show_per
    @challenge = Challenge.find(params[:id])
    #GETING ALL USER CONNECTION
    aConnection = []
    @allConnections = UserConnection.select(:target_id).where(:user_id=>current_user.id)
---
SELECT target_id FROM `user_connections` WHERE `user_connections`.`user_id` = 1

		# referenced documents can only be saved when parent exists
		if !params[:invitees].nil?
			params[:invitees].split(",").each do |aFBId|
				current_user.user_connections.find_or_create_by_target_id(:target_id => aFBId )
---
SELECT `user_connections`.* FROM `user_connections` WHERE `user_connections`.`user_id` = 1 AND `user_connections`.`target_id` = '100000974421554' LIMIT 1

	def mForWinner
		@winnerList = params[:winnerList]
		@winnerList.split(" ").each do |eachWinner|
				whomSend = Authentication.find_by_uid(eachWinner)
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`uid` = '100001071283803' LIMIT 1