app/controllers/messages_controller.rb

  def individualAllMessage
    @iId = params[:iId]
    @wayToRead = Message.where(:_id => params[:id]).first
    @wayToRead.update_attributes(:isRead => 1)
    details = Authentication.find_by_uid(params[:iId])
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`uid` = '100001127860468' LIMIT 1